[
    {   
        "id": 1,
        "img":"img/Main/2.stargazy-pie.png",
        "name": "Stargazy Pie",
        "explanation": "Stargazy pie is a traditional English dish from Cornwall. It's a savory pie made with whole sardines (or pilchards), eggs, and potatoes, with the fish heads poking out through the crust—as if they're gazing at the stars.",
        "place":"Stargazy pie originates from Mousehole, a small fishing village in Cornwall, England. It is linked to a local legend about a fisherman named Tom Bawcock, who went out to sea during a storm to save the village from starvation. To celebrate his bravery, a pie was made with fish heads poking through the crust to show that it was filled with fish — and it became known as Stargazy Pie.",
        "placeImg1": "img/Main/StargazyPie/placeImg1.jpg",
        "placeImg2": "img/Main/StargazyPie/placeImg2.jpg",

        "history": "Stargazy pie originated from the fishing village of Mousehole in Cornwall, a region in southwestern England known for its Celtic heritage and strong maritime culture. The pie, named for the way fish heads protrude through the crust as if gazing at the stars, is rooted in a local legend from the 16th century. <br><br> During a fierce storm that left the villagers starving, a brave fisherman named Tom Bawcock ventured out to sea and returned with a large catch of pilchards. These were baked into a communal pie to feed the village, and his heroic act has since been commemorated with an annual feast celebrating the creation of Stargazy pie.",
        "historyImg1": "img/Main/StargazyPie/historyImg1.webp",
        "historyImg2": "img/Main/StargazyPie/historyImg2.webp",
        "historyImg3": "img/Main/StargazyPie/historyImg3.avif",

        "factsImg1": "img/Main/StargazyPie/factsImg1.webp",
        "factsImg2": "img/Main/StargazyPie/factsImg2.jpg",
        "factsImg3": "img/Main/StargazyPie/factsImg3.webp",
        "factsTitle1": "To Honor a Local Hero",
        "factsTitle2": "Celebrated Every Year",
        "factsTitle3": "Strange Appearance but Delicious",
        "factsExplanation1": "Stargazy Pie was created to honor the bravery of Tom Bawcock, a legendary fisherman from Mousehole, who dared to sail out during a storm to save the villagers from starvation. This legend is the basis of the annual Tom Bawcock's Eve celebration held on December 23.",
        "factsExplanation2": "Every December 23, the people of Mousehole celebrate Tom Bawcock's Eve with lantern parades and the serving of Stargazy Pie as a symbol of courage and community. The festival also features spectacular village illuminations.",
        "factsExplanation3": "Stargazy Pie is known for its unique appearance fish heads poking through the crust, as if gazing at the stars. While some might find this look strange or off-putting, for the people of Cornwall it symbolizes bravery and tradition.",

        "gallery1": "img/Main/StargazyPie/gallery1.jpg",
        "gallery2": "img/Main/StargazyPie/gallery2.jpg",
        "gallery3": "img/Main/StargazyPie/gallery3.jpg",
        "gallery4": "img/Main/StargazyPie/gallery4.jpg",
        "gallery5": "img/Main/StargazyPie/gallery5.jpg",

        "ingredients": ["30g/1oz butter", "1 onion, finely chopped", "1 leek, finely chopped", "3 rashers (smoked or unsmoked) streaky bacon, finely chopped", "20g/¾oz plain flour", "3 tbsp dry white wine", "250ml/9fl oz fish stock", "300ml/10fl oz double cream", "pinch saffron strands", "1 tsp salt", "small bunch fresh parsley, chopped", "3 free-range eggs, 2 hard-boiled and chopped, 1 beaten to glaze", "200g/7oz puff pastry", "6 small mackerel, butterflied with the heads on (backbone and tail removed)", "freshly ground black pepper", "boiled new potatoes and green vegetables, to serve"],
        "recipeSteps": ["Preheat the oven to 200C/180C Fan/Gas 6.","Melt the butter in a pan over a low heat, add the onion, leek and bacon and cook over a low heat until very soft but not browned.","Stir in the flour to make a roux and cook for a minute. Add the white wine and fish stock, stir well to remove any lumps, bring to the boil, then turn down to a simmer and cook for 5-10 minutes until the sauce has thickened. Add the cream and bring to the boil, stirring until you have a thick sauce. Add the saffron, salt and some pepper, stir in the parsley and fold in the chopped hard-boiled eggs.","Roll out the pastry to about 3mm/⅛in thick. Cut out a long, 2cm/¾in wide strip of pastry. Dampen the rim of a deep pie dish with water and press the pastry strip onto the rim. Pour a little of the sauce into the dish and arrange the mackerel on top, with their heads on the edges of the dish. Pour over the remaining sauce.","Cut out a piece of pastry a little bigger than the size of the dish, then cut slits in the pastry large enough to poke the mackerel heads through. Carefully lower onto the pie dish, then, working around the dish one fish at a time, poke the fish heads through the pastry. Brush the pastry with beaten egg and bake for 40-45 minutes until the pastry is golden and crisp. Serve with new potatoes and green vegetables."] 
    },
    {   
        "id": 2,
        "img":"img/Main/3.toad-in-the-hole.png",
        "name": "Toad in the Hole",
        "explanation": "Toad in the Hole is a traditional British dish made by baking sausages in a batter similar to Yorkshire pudding. The sausages are placed in a hot baking dish, and the batter is poured over them before baking. It's usually served with onion gravy and vegetables.",
        "place":"Toad in the Hole is a traditional English dish, but its exact place of origin is not known. It likely came from somewhere in England during the 18th century as a way to stretch meat using simple batter. But some say that Toad-in-the-Hole originates from the town of Alnmouth in Northumberland, where the local golf course was overrun with Natterjack toads.",
        "placeImg1": "img/Main/ToadInTheHole/placeImg1.png",
        "placeImg2": "img/Main/ToadInTheHole/placeImg2.png",

        "history": "Toad in the Hole originated in the early 18th century when batter puddings became popular, often used in poor households to stretch small amounts of meat. The earliest printed references, such as in 1762, described it as a “vulgar” term for meat baked in a large pudding. Originally, various inexpensive meats like pigeon were used, as seen in Hannah Glasse's 1747 cookbook. <br><br> By the 19th century, it was known as a cheap yet flavorful dish, appearing in cookbooks by Francatelli and Mrs. Beeton, and even made its way into Italian cuisine. During World War I, it became a common school meal. In the 21st century, the dish evolved with vegetarian and vegan variations, though a 2017 survey showed that 23% of Britons had never tried it.",
        "historyImg1": "img/Main/ToadInTheHole/historyImg1.png",
        "historyImg2": "img/Main/ToadInTheHole/historyImg2.jpg",
        "historyImg3": "img/Main/ToadInTheHole/historyImg3.jpg",

        "factsImg1": "img/Main/ToadInTheHole/factsImg1.webp",
        "factsImg2": "img/Main/ToadInTheHole/factsImg2.jpg",
        "factsImg3": "img/Main/ToadInTheHole/factsImg3.jpg",
        "factsTitle1": "No Toads Involved!",
        "factsTitle2": "Mysterious Name Origins",
        "factsTitle3": "A Dish Born of Necessity",
        "factsExplanation1": "Despite its name, Toad in the Hole contains no toads. The dish consists of sausages baked in Yorkshire pudding batter. The name is believed to derive from the sausages peeking out of the batter, resembling toads poking their heads from holes.",
        "factsExplanation2": "The exact origin of the name Toad in the Hole is unclear. One theory suggests it refers to the appearance of sausages poking through the batter, similar to toads in their burrows. Another anecdote links the name to a golf course incident in Alnmouth, Northumberland, where a toad allegedly popped out of a hole during a game, inspiring a local chef to create the dish",
        "factsExplanation3": "Toad in the Hole originated in the 18th century as an economical meal for working-class families. It was a way to stretch limited meat supplies by baking inexpensive cuts or leftover meats in a batter, providing a filling and affordable dish",

        "gallery1": "img/Main/ToadInTheHole/gallery1.jpg",
        "gallery2": "img/Main/ToadInTheHole/gallery2.webp",
        "gallery3": "img/Main/ToadInTheHole/gallery3.jpg",
        "gallery4": "img/Main/ToadInTheHole/gallery4.jpg",
        "gallery5": "img/Main/ToadInTheHole/gallery5.jpg",

        "ingredients": ["115g/4oz plain flour", "large pinch of salt","freshly ground black pepper", "4 large free-range eggs", "300ml/½ pint milk", "2 tbsp/30g fresh thyme leaves", "8 good quality pork", "beef or vegetarian sausages", "2 tbsp/30g Dijon mustard", "2 tbsp/30g of beef dripping or white vegetable fat for vegetarians", "knob of butter"],
        "recipeSteps": ["To make the batter, sift the flour into a large bowl. Add the salt and pepper.", "Make a well in the centre of the flour and crack in the eggs. Using a wooden spoon, gradually beat the eggs into the flour then slowly beat in the milk until the batter is the consistency of double cream.", "Strain and push any remaining lumps through a sieve. Stir in the thyme. Cover and leave to stand for 30 minutes, or ideally 3-4 hours.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a large non-stick pan and cook the sausages over a medium heat until golden-brown all over. (If you do not have a non-stick pan add a little oil.) Turn off the heat and brush the sausages with the mustard. Set aside.", "Place the dripping or white vegetable fat into an ovenproof dish and heat in the oven for five minutes or until the dripping is hot and hazy.", "Add the sausages to the hot dish and pour in the batter. Immediately return the dish to the oven and cook for 35-40 minutes until well-risen and golden-brown.", "Serve seasoned with black pepper and a large knob of butter."] 
    },
    {   
        "id": 3,
        "img":"img/Main/4.yorkshire-pudding.png" ,
        "name": "Yorkshire Pudding",
        "explanation": "Yorkshire pudding is a traditional British dish made from a batter of eggs, flour, and milk or water. It's baked in the oven until it puffs up and turns golden brown, with a crispy outside and soft, airy inside. Yorkshire pudding is most commonly served as part of a Sunday roast, especially with roast beef and gravy.",
        "place":"The dish originated in Yorkshire, a historic region in northern England. It was first created as a way to make use of the fat that dripped from roasting meat, by placing the batter underneath the meat while it cooked. Originally served as a starter to fill people up before the more expensive meat course, it has become a well-loved part of British cuisine.",
        "placeImg1": "img/Main/YorkshirePudding/placeImg1.jpg",
        "placeImg2": "img/Main/YorkshirePudding/placeImg2.webp",

        "history": "Yorkshire pudding has a rich history dating back to at least the 1700s, originally referred to as 'Dripping Pudding' due to its preparation method, where it was cooked beneath roasting meat to catch the drippings. It became a staple of British cuisine, particularly served with roast beef, and is considered a centerpiece of traditional Sunday lunches. <br><br> Over the years, Yorkshire pudding has survived various historical challenges, including food rationing during the wars, and has adapted to modern cooking practices. Today, it remains a beloved dish, often enjoyed in various forms across the UK.",
        "historyImg1": "img/Main/YorkshirePudding/historyImg1.jpg",
        "historyImg2": "img/Main/YorkshirePudding/historyImg2.webp",
        "historyImg3": "img/Main/YorkshirePudding/historyImg3.webp",

        "factsImg1": "img/Main/YorkshirePudding/factsImg1.jpg",
        "factsImg2": "img/Main/YorkshirePudding/factsImg2.jpg",
        "factsImg3": "img/Main/YorkshirePudding/factsImg3.jpg",
        "factsTitle1": "Only Three Main Ingredients",
        "factsTitle2": "Originally called Dripping Pudding",
        "factsTitle3": "Special day",
        "factsExplanation1": "Yorkshire pudding is made from a simple mixture: eggs, milk, and flour. Although the recipe seems easy, precise cooking technique is crucial to achieve the signature puffed and crispy texture.",
        "factsExplanation2": "The first Yorkshire pudding recipe appeared in 1737 in the book The Whole Duty of a Woman under the name 'Dripping Pudding'. This name refers to the fat that drips from roasted meat and is used to cook the batter.",
        "factsExplanation3": "In the UK, National Yorkshire Pudding Day is celebrated every first Sunday of February, while in the United States, it is celebrated on October 13.",

        "gallery1": "img/Main/YorkshirePudding/gallery1.jpg",
        "gallery2": "img/Main/YorkshirePudding/gallery2.avif",
        "gallery3": "img/Main/YorkshirePudding/gallery3.jpg",
        "gallery4": "img/Main/YorkshirePudding/gallery4.jpg",
        "gallery5": "img/Main/YorkshirePudding/gallery5.jpg",

        "ingredients": ["3 large eggs","3/4 cup milk","3/4 cup flour","3/4 teaspoon salt","1/2 cup melted butter (Rendered beef or pork fat can be substituted for butter for a more traditional flavor.)"],
        "recipeSteps": ["Preheat the oven to 400 degrees Fahrenheit.","Whisk together eggs and milk until they are foamy, and then mix with flour and salt. Do not overmix. Allow the batter to rest at room temperature for 30 minutes.","Add about a teaspoon of fat to each cup of a muffin tin. Place the tin in the oven to heat for five to seven minutes.","Fill each cup of the muffin tin to about half full, and return the tin to the oven for 10 to 12 minutes, or until the puddings are crisp and golden brown. Serve immediately, drizzled with remaining melted butter as desired."] 
    },
    {   
        "id": 4,
        "img":"img/Main/8.fish-n-chips1.png" ,
        "name": "Fish and Chips",
        "explanation": "Fish and chips is one of the most iconic traditional British dishes. It consists of battered and deep-fried white fish (usually cod or haddock) served with thick-cut fried potatoes, known as chips. It's often enjoyed with sides like mushy peas, tartar sauce, or a splash of vinegar.",
        "place":"The dish became popular in the 19th century during the Industrial Revolution, when it was sold as cheap, filling street food for working-class families. While fried fish was introduced to Britain by Jewish immigrants from Spain and Portugal, and chips were inspired by Belgian or French fried potatoes, the combination of the two is believed to have first appeared in England. Both London and Lancashire claim to be the birthplace of fish and chips.",
        "placeImg1": "img/Main/FishnChips/placeImg1.jpg",
        "placeImg2": "img/Main/FishnChips/placeImg2.avif",

        "history": "Fish and chips is considered a classic British street food, often made with cod or haddock and served with vinegar. Though now a symbol of British culture, its origins are tied to immigration. In the 16th century, Sephardic Jews fleeing religious persecution in Portugal brought with them peshkada frito (fried fish), a dish eaten cold on the Sabbath. This method of preserving fish with batter became popular in England. <br><br> Chips came later, with thick-cut potatoes first sold in 1854. The first fish and chip shop is widely credited to Joseph Malin, a Jewish immigrant in London around 1860. During the Industrial Revolution, fish and chips became a cheap, filling meal for the working class, often wrapped in old newspapers until health regulations ended the practice. Today, fish and chips remains a beloved part of British cuisine, shaped by history and migration.",
        "historyImg1": "img/Main/FishnChips/historyImg1.jpg",
        "historyImg2": "img/Main/FishnChips/historyImg2.jpg",
        "historyImg3": "img/Main/FishnChips/historyImg3.avif",

        "factsImg1": "img/Main/FishnChips/factsImg2.jpg",
        "factsImg2": "img/Main/FishnChips/factsImg1.jpg",
        "factsImg3": "img/Main/FishnChips/factsImg3.png",
        "factsTitle1": "Chippies",
        "factsTitle2": "National Dish Status",
        "factsTitle3": "Malin's of Bow",
        "factsExplanation1": "Fish and chips became so essential during WWII that it was one of the few foods not rationed in Britain. ",
        "factsExplanation2": "Fish and chips shops, known as 'chippies' played an important social role during World War II. Even with food rationing, fish and chips remained one of the few meals not heavily rationed, providing affordable comfort and morale boosts to the British public during difficult times.",
        "factsExplanation3": "The first fish and chips shop in the UK was opened by Jewish immigrant Joseph Malin in London around 1860",

        "gallery1": "img/Main/FishnChips/gallery1.jpg",
        "gallery2": "img/Main/FishnChips/gallery2.jpg",
        "gallery3": "img/Main/FishnChips/gallery3.jpg",
        "gallery4": "img/Main/FishnChips/gallery4.jpg",
        "gallery5": "img/Main/FishnChips/gallery5.webp",

        "ingredients": ["4 haddock fillets, each weighing 170g","3 1/2 oz of plain flour, seasoned","7 1/16 oz of plain flour","5 1/16 fl oz of lager beer","1/4 oz of salt","1/4 oz of pepper","5 1/16 fl oz of ale","1/4 oz of mild curry powder","2 banana shallots, diced","1 garlic clove, crushed","1 3/4 oz of butter","14 1/8 oz of peas","3 egg yolks","6 3/4 fl oz of pomace oil (1)","3 1/2 fl oz of nut oil","1 tsp English mustard","1/2 garlic clove, crushed","1/2 garlic clove, roasted","1 dash of lemon juice","salt","black pepper","6 Désirée potatoes","3 1/4 pints of groundnut oil","1 pinch of rock salt","2 shallots, diced","1 egg, hard boiled","1 3/4 oz of cornichons","1 3/4 oz of capers","1 oz of chives","1/3 oz of tarragon","1 lemon, zested"],
        "recipeSteps": ["To make the perfect fish and chips recipe you need to start by buying the right fish - ensure that the fish has no scales when buying it. Smaller fillets work well for fish and chips as you get more texture with the batter (4 haddock fillets)","To make the fish batter recipe combine all the ingredients, flour, lager beer, salt, pepper, ale and curry powder in a bowl and whisk until smooth. The batter needs to be as thin as possible so it's nice and light","For the mayonnaise, ensure all the ingredients are the same temperature. Put the egg yolks in a blender with the mustard and garlic and blend for 30 seconds","This stage is critical to the process. Add both the oils very slowly while the blender is on, once the emulsion has formed you can add the rest of the oil in a slow steady stream - if it gets too thick half way through, let down with the lemon juice and a tablespoon of water","Once all the oil is emulsified, season to taste with salt, pepper and lemon juice","For the tartare sauce, chop the herbs, cornichons, and capers. Next grate a hard boiled egg and combine with the diced shallots and the mayonnaise. Season to taste","For the crushed peas, sweat down the garlic and shallots in the butter. Add the peas and toss in the hot butter","When most of the peas are soft, pulse for 10 seconds in the blender and return to the pan and keep warm","To make the chips. Peel the potatoes and cut them into even-sized, not too thin batons. Wash under cold water to remove any starch. Drain well","Heat the oil (preferably groundnut) in a deep fat fryer to 130°C. Fry the chips for 7-8 minutes until soft. Lift out of the oil and drain","Reheat the oil to 180°C and return the chips to the pan, cooking until they are crispy and brown. Drain well and season with fine rock salt. Keep in warm place while you cook the fish","Set the deep fat fryer to 180°C, toss the fish in seasoned plain flour and pat off. Dip in the batter and allow most of the batter to run off the fish - it only has to be lightly coated","Hold each fillet halfway into the oil for 30 seconds before lowering it in gently - if you let go straight away it will sink to the bottom and stick","The fish should take approx 4 minutes and 30 seconds to cook - ensure the batter is golden and crisp. Remove and drain thoroughly on kitchen paper, then keep warm in a low oven while you cook the remaining fish in the same way.","Serve the fish and chips with the warm crushed peas, tartare sauce and a wedge of lemon"] 
    },
    {   
        "id": 5,
        "img":"img/Main/9.cornish-pasty.png" ,
        "name": "Cornish Pasty",
        "explanation": "Cornish pasty is a traditional baked pastry from Cornwall, a region in the southwest of England. It's shaped like a half-moon and filled with beef, potatoes, onions, and swede (a type of turnip), all seasoned and wrapped in a golden, flaky crust.",
        "place":"It was originally made as a portable, hearty meal for Cornish tin miners in the 18th and 19th centuries. The thick crimped edge acted as a handle so miners could eat without touching the rest of the pasty with their dirty hands. Today, Cornish pasties are a symbol of Cornish heritage and have even been given Protected Geographical Indication (PGI) status in the UK.",
        "placeImg1": "img/Main/CornishPasty/placeImg1.jpg",
        "placeImg2": "img/Main/CornishPasty/placeImg2.jpg",

        "history": "13th Century, Pasties were first consumed by nobility and members of the royal family. They featured luxurious fillings such as venison, beef, lamb, and seafood like eels, along with rich gravies and fruits. <br><br> 18th and 19th Centuries (1700s-1800s). They became popular among the working class in Cornwall, especially among miners. The fillings became simpler: potatoes, swede (yellow turnip/rutabaga), onions, and occasionally some cheap cuts of meat. This marked the beginning of the “humble” version of the Cornish pasty.'Oggy, Oggy, Oggy' In the Cornish language, a pasty is called an 'Oggy'. When the pasties were ready, wives would shout down the mine shaft: 'Oggy, Oggy, Oggy!' And the miners would reply: 'Oi, Oi, Oi!'. <br><br> The easiest way to nail down the flavor of a Cornish pasty is to look at the ingredients that go into making one. Recipes like the one shared by BBC Good Food have a crust made with both butter and lard. Martha Stewart says that these two fats together create a crust that is both flaky and flavorful.",
        "historyImg1": "img/Main/CornishPasty/historyImg1.webp",
        "historyImg2": "img/Main/CornishPasty/historyImg2.jpg",
        "historyImg3": "img/Main/CornishPasty/historyImg3.jpg",

        "factsImg1": "img/Main/CornishPasty/factsImg1.jpg",
        "factsImg2": "img/Main/CornishPasty/factsImg2.png",
        "factsImg3": "img/Main/CornishPasty/factsImg3.jpg",
        "factsTitle1": "Miners' Lunch",
        "factsTitle2": "Protected Status",
        "factsTitle3": "Space Food",
        "factsExplanation1": "The Cornish pasty was designed with a thick crimped edge so miners could hold it without touching the food, as their hands were often contaminated with arsenic.",
        "factsExplanation2": "In 2011, the Cornish pasty was granted Protected Geographical Indication (PGI) status, meaning only pasties made in Cornwall can be called 'Cornish pasties.'",
        "factsExplanation3": "A Cornish pasty was taken to space in 1998 by British astronaut Helen Sharman.",

        "gallery1": "img/Main/CornishPasty/gallery1.jpg",
        "gallery2": "img/Main/CornishPasty/gallery2.jpg",
        "gallery3": "img/Main/CornishPasty/gallery3.jpg",
        "gallery4": "img/Main/CornishPasty/gallery4.jpg",
        "gallery5": "img/Main/CornishPasty/gallery5.jpg",

        "ingredients": ["500 g strong bread flour (it is important to use a stronger flour than normal as you need the extra strength in the gluten to produce strong pliable pastry)","120 g lard or white shortening","125 g Cornish butter","1 tsp salt","175 ml cold water","400 g good quality beef skirt, cut into cubes","300 g potato, peeled and diced","150 g swede/turnip (The vegetable to use is the yellow-fleshed swede, not a white turnip.  This is known commonly in Cornwall as the turnip.  It's also known as the yellow turnip/Swedish turnip in some places and in North America it is called rutabaga), peeled and diced","150 g onion, peeled and sliced","Salt & pepper to taste (2:1 ratio)","Beaten egg or milk to glaze"],
        "recipeSteps": ["Add the salt to the flour in a large mixing bowl.","Rub the two types of fat lightly into flour until it resembles breadcrumbs.","Add water, bring the mixture together and knead until the pastry becomes elastic. This will take longer than normal pastry but it gives the pastry the strength that is needed to hold the filling and retain a good shape. This can also be done in a food mixer.","Cover with cling film and leave to rest for 3 hours in the fridge. This is a very important stage as it is almost impossible to roll and shape the pastry when fresh.","Roll out the pastry and cut into circles approx. 20cm diameter. A side plate is an ideal size to use as a guide.","Layer the vegetables and meat on top of the pastry, adding plenty of seasoning as you go. The amount of salt and pepper to use will vary according to taste but a good rule of thumb is to use a good pinch of salt and a gentle pinch of pepper on each layer.","Bring the pastry around and crimp the edges together (see our guide to crimping).","Glaze with beaten egg or an egg and milk mixture.","Bake at 165 degrees C (fan oven) for about 50 - 55 minutes until golden."] 
    },
    {   
        "id": 6,
        "img":"img/Main/10.beef-wellington.png" ,
        "name": "Beef Wellington",
        "explanation": "Beef Wellington is a classic British dish made of a beef tenderloin (usually filet mignon) coated with mushroom duxelles and sometimes pâté, then wrapped in puff pastry and baked until golden. The result is a crispy outside with tender, juicy beef inside.",
        "place":"Although its exact origin is debated, Beef Wellington became popular in England in the 19th century, possibly named after Arthur Wellesley, the 1st Duke of Wellington, who defeated Napoleon at the Battle of Waterloo. Some believe the dish was created to celebrate him, while others think it was simply an English twist on a French dish like filet de bœuf en croûte. Regardless of its origin, Beef Wellington is now a beloved part of British fine dining.",
        "placeImg1": "img/Main/BeefWellington/placeImg1.jpg",
        "placeImg2": "img/Main/BeefWellington/placeImg2.webp",

        "history": "The name Beef Wellington is believed to have been given in honor of Arthur Wellesley, an Irish general in the British army who later became the first Duke of Wellington. <br><br> It is said that the dish was created to celebrate his victory over Napoleon Bonaparte at the Battle of Waterloo in 1815. Due to its resemblance to Wellington boots, the elongated, pastry-wrapped shape of Beef Wellington is often said to mirror the style of boots popularized by the Duke in the 19th century. ",
        "historyImg1": "img/Main/BeefWellington/historyImg1.jpg",
        "historyImg2": "img/Main/BeefWellington/historyImg2.jpg",
        "historyImg3": "img/Main/BeefWellington/historyImg3.jpg",

        "factsImg1": "img/Main/BeefWellington/factsImg1.avif",
        "factsImg2": "img/Main/BeefWellington/factsImg2.webp",
        "factsImg3": "img/Main/BeefWellington/factsImg3.avif",
        "factsTitle1": "Rich, meaty taste",
        "factsTitle2": "Named After a Duke",
        "factsTitle3": "A Dish for Royalty",
        "factsExplanation1": "The beef has a rich, meaty taste that is accented by the seasoning used during cooking. Fans of steak will find the flavor familiar and comforting. But the taste does not stop there. Beef Wellington also features a layer of mushroom duxelles.",
        "factsExplanation2": "Beef Wellington is believed to be named after Arthur Wellesley, the 1st Duke of Wellington, who famously defeated Napoleon at Waterloo.",
        "factsExplanation3": "It was rumored to be a favorite of British royalty, including King George IV.",

        "gallery1": "img/Main/BeefWellington/gallery1.avif",
        "gallery2": "img/Main/BeefWellington/gallery2.jpg",
        "gallery3": "img/Main/BeefWellington/gallery3.jpg",
        "gallery4": "img/Main/BeefWellington/gallery4.webp",
        "gallery5": "img/Main/BeefWellington/gallery5.jpg",

        "ingredients": ["2 x 400g beef fillets","Olive oil, for frying","500g mixture of wild mushrooms, cleaned","1 thyme sprig, leaves only","500g puff pastry","8 slices of Parma ham","2 egg yolks, beaten with 1 tbsp water and a pinch of salt","Sea salt and freshly ground black pepper","2 tbsp olive oil","200g beef trimmings (ask the butcher to reserve these when trimming the fillet)","4 large shallots, peeled and sliced","12 black peppercorns","1 bay leaf","1 thyme sprig","Splash of red wine vinegar","1 x 750ml bottle red wine","750ml beef stock"],
        "recipeSteps": ["Wrap each piece of beef tightly in a triple layer of cling film to set its shape, then chill overnight.","Remove the cling film, then quickly sear the beef fillets in a hot pan with a little olive oil for 30-60 seconds until browned all over and rare in the middle. Remove from the pan and leave to cool.","Finely chop the mushrooms and fry in a hot pan with a little olive oil, the thyme leaves and some seasoning. When the mushrooms begin to release their juices, continue to cook over a high heat for about 10 minutes until all the excess moisture has evaporated and you are left with a mushroom paste (known as a duxelle). Remove the duxelle from the pan and leave to cool.","Cut the pastry in half, place on a lightly floured surface and roll each piece into a rectangle large enough to envelop one of the beef fillets. Chill in the refrigerator.","Lay a large sheet of cling film on a work surface and place 4 slices of Parma ham in the middle, overlapping them slightly, to create a square. Spread half the duxelle evenly over the ham.","Season the beef fillets, then place them on top of the mushroom-covered ham. Using the cling film, roll the Parma ham over the beef, then roll and tie the cling film to get a nice, evenly thick log. Repeat this step with the other beef fillet, then chill for at least 30 minutes.","Brush the pastry with the egg wash. Remove the cling film from the beef, then wrap the pastry around each ham-wrapped fillet. Trim the pastry and brush all over with the egg wash. Cover with cling film and chill for at least 30 minutes.","Meanwhile, make the red wine sauce. Heat the oil in a large pan, then fry the beef trimmings for a few minutes until browned on all sides. Stir in the shallots with the peppercorns, bay and thyme and continue to cook for about 5 minutes, stirring frequently, until the shallots turn golden brown.","Pour in the vinegar and let it bubble for a few minutes until almost dry. Now add the wine and boil until almost completely reduced. Add the stock and bring to the boil again. Lower the heat and simmer gently for 1 hour, removing any scum from the surface of the sauce, until you have the desired consistency. Strain the liquid through a fine sieve lined with muslin. Check for seasoning and set aside.","When you are ready to cook the beef wellingtons, score the pastry lightly and brush with the egg wash again, then bake at 200°C/Gas 6 for 15-20 minutes until the pastry is golden brown and cooked. Rest for 10 minutes before carving.","Meanwhile, reheat the sauce. Serve the beef wellingtons sliced, with the sauce as an accompaniment."] 
    },
    {   
        "id": 7,
        "img":"img/Main/11.steak-n-kidneypie.png" ,
        "name": "Steak and Kidney Pie",
        "explanation": "Steak and kidney pie is a traditional British savory pie made with diced beef, kidney (usually lamb or pork), onions, and rich brown gravy, all encased in a flaky or shortcrust pastry.",
        "place":"It became popular in 19th-century England, especially among the working class, as it was hearty, affordable, and filling. The dish is closely associated with English pub food and is considered a comfort classic. Over time, it has become a staple of British cuisine, often served with mashed potatoes and vegetables.",
        "placeImg1": "img/Main/SteaknKidneyPie/placeImg1.jpg",
        "placeImg2": "img/Main/SteaknKidneyPie/placeImg2.jpg",

        "history": "Before the 19th Century (up to the mid-1800s) Steak pudding and kidney pie were more commonly found as two separate dishes. A record from 1826 mentions stacks of kidney pies in the window of a bakery near Smithfield, London.In 1836, there was a traveling kidney pie vendor near the Old Vic, using a portable oven that emitted sparks whenever opened <br><br> Mid-19th Century, the combination of steak and kidney began to gain popularity, first recorded as a recipe by Mrs. Beeton in 1859 in her book Household Management. Mrs. Beeton received the recipe from a correspondent in Sussex — indicating it was originally a regional dish. Late 1800s, by the 1870s, pies combining steak and kidney were mentioned as often as kidney pies alone. They appeared in popular poems and songs, reflecting how well-known the dish had become in culinary culture at the time.",
        "historyImg1": "img/Main/SteaknKidneyPie/historyImg1.jpg",
        "historyImg2": "img/Main/SteaknKidneyPie/historyImg2.jpg",
        "historyImg3": "img/Main/SteaknKidneyPie/historyImg3.jpg",

        "factsImg1": "img/Main/SteaknKidneyPie/factsImg1.jpg",
        "factsImg2": "img/Main/SteaknKidneyPie/factsImg2.jpg",
        "factsImg3": "img/Main/SteaknKidneyPie/factsImg3.webp",
        "factsTitle1": "Rich and Savory Dish",
        "factsTitle2": "A Dickensian Favorite",
        "factsTitle3": "The Earliest Modern Style",
        "factsExplanation1": "Steak and Kidney Pie tastes like a mix of hearty beef and a slightly earthy kidney. The crust is buttery and flaky, which adds a nice crunch.",
        "factsExplanation2": "Charles Dickens mentioned steak and kidney pie in his 1848 novel The Old Curiosity Shop, showing its long-standing popularity.",
        "factsExplanation3": "From around 1851 was very simple, just beef steak, kidney, salt, and pepper. It had no herbs, spices, or vegetables, reflecting the plain, hearty cooking style of the time.",

        "gallery1": "img/Main/SteaknKidneyPie/gallery1.jpg",
        "gallery2": "img/Main/SteaknKidneyPie/gallery2.jpg",
        "gallery3": "img/Main/SteaknKidneyPie/gallery3.jpg",
        "gallery4": "img/Main/SteaknKidneyPie/gallery4.jpg",
        "gallery5": "img/Main/SteaknKidneyPie/gallery5.jpg",

        "ingredients": ["500g (1 lb) beef stewing steak-diced, for tender bites.","250g (8.8 oz) lamb kidneys-trimmed and diced, for the classic kidney flavor.","1 large onion-finely chopped, for sweetness and depth.","2 tablespoons plain flour-to thicken the filling.","500ml (17 fl oz) beef stock-for a rich, savory base.","1 tablespoon Worcestershire sauce-adds a tangy, umami flavor.","2 bay leaves-for an extra layer of flavor.","Salt and pepper-to taste.","2 tablespoons vegetable oil-for browning the meat.","1 sheet of ready-rolled puff pastry-for a golden, flaky topping.","1 egg-beaten, for brushing the pastry."],
        "recipeSteps": ["Preheat the oven: Set your oven to 180°C (350°F) to prepare for baking the pie.","Brown the steak and kidneys: Heat the oil in a large frying pan over medium-high heat. Add the diced beef steak and lamb kidneys, season with salt and pepper, and cook until browned on all sides. Remove from the pan and set aside.","Cook the onions: In the same pan, add the chopped onion and cook until softened. Stir in the flour and cook for an additional minute to thicken.","Create the gravy: Gradually add the beef stock and Worcestershire sauce to the pan, stirring constantly to avoid lumps. Add the bay leaves and bring the mixture to a simmer.","Combine the meat and gravy: Return the browned steak and kidneys to the pan, stir well, and simmer on low heat for 20-30 minutes to allow the flavors to meld. Remove the bay leaves before assembling the pie.","Assemble the pie: Transfer the steak and kidney mixture into a casserole dish. Roll out the puff pastry if needed and place it over the filling, trimming any excess. Crimp the edges to seal and brush with beaten egg for a golden finish.","Bake the pie: Place the pie in the preheated oven and bake for 25-30 minutes, or until the pastry is golden brown and crisp.","Serve hot: Allow the pie to cool slightly before serving. Enjoy it with mashed potatoes or steamed vegetables for a complete meal."] 
    },
    {   
        "id": 8,
        "img":"img/Main/12.lancashire-hotpot.png" ,
        "name": "Lanchashire Hotpot",
        "explanation": "Lancashire hotpot is a classic British stew made with tender pieces of lamb or mutton, sliced onions, and sometimes root vegetables like carrots. The ingredients are slow-cooked together and topped with thinly sliced potatoes arranged in layers, which turn golden and crispy as they bake. The result is a warm, hearty dish that's rich in flavor and perfect for colder days.",
        "place":"This dish comes from Lancashire, a region in North West England, and became especially popular during the Industrial Revolution. It was a practical meal for working families, as it could be prepared in one pot and left to cook slowly while people were away at work. Today, Lancashire hotpot remains a symbol of traditional British comfort food.",
        "placeImg1": "img/Main/LanchashireHotpot/placeImg1.jpg",
        "placeImg2": "img/Main/LanchashireHotpot/placeImg2.jpg",

        "history": "Lancashire Hotpot is believed to have originated during the cotton industry era in the 19th century. This simple dish was cooked slowly throughout the day, ready to be eaten by hungry cotton mill workers after their shifts. <br><br> At that time, it most likely used old sheep meat (mutton) and was usually cooked with a lamb bone to enhance the flavor. The meat was often bulked out with oysters, which were very cheap and readily available in the 19th century.",
        "historyImg1": "img/Main/LanchashireHotpot/historyImg1.jpg",
        "historyImg2": "img/Main/LanchashireHotpot/historyImg2.webp",
        "historyImg3": "img/Main/LanchashireHotpot/historyImg3.jpg",

        "factsImg1": "img/Main/LanchashireHotpot/factsImg1.jpg",
        "factsImg2": "img/Main/LanchashireHotpot/factsImg2.webp",
        "factsImg3": "img/Main/LanchashireHotpot/factsImg3.jpg",
        "factsTitle1": "Originally a practical meal for factory workers in northern England",
        "factsTitle2": "A Working-Class Staple",
        "factsTitle3": "Poor Man's Pie",
        "factsExplanation1": "It was designed to cook slowly in the oven while the workers were away. By the time they came home, a warm, hearty dish with tender lamb and a crispy potato topping was ready to eat",
        "factsExplanation2": "Lancashire hotpot originated as a cheap, slow-cooked meal for workers in the cotton mills of Lancashire.",
        "factsExplanation3": "During the Industrial Revolution, cotton mill workers would cook it slowly to refrigerate for supper after a long day",

        "gallery1": "img/Main/LanchashireHotpot/gallery1.jpg",
        "gallery2": "img/Main/LanchashireHotpot/gallery2.jpg",
        "gallery3": "img/Main/LanchashireHotpot/gallery3.jpg",
        "gallery4": "img/Main/LanchashireHotpot/gallery4.jpg",
        "gallery5": "img/Main/LanchashireHotpot/gallery5.webp",

        "ingredients": ["100g dripping or butter","900g stewing lamb","3 lamb kidneys","2 medium onions","4 carrots","25g plain flour","2 tsp Worcestershire sauce","500ml lamb or chicken stock","2 bay leaves","900g potato"],
        "recipeSteps": ["Heat oven to 160C/fan 140C/gas 3.","Heat a little of the 100g dripping or butter in a large shallow casserole dish and brown 900g stewing lamb chunks in batches, lift to a plate, then repeat with 3 trimmed and sliced lamb kidneys.","Fry 2 chopped onions and 4 peeled and sliced carrots in the pan with a little more dripping until golden.","Sprinkle over 25g plain flour, allow to cook for a couple of mins, shake over 2 tsp Worcestershire sauce, pour in 500ml lamb or chicken stock, then bring to the boil.","Stir in the stewing lamb and kidneys and 2 bay leaves, then turn off the heat.","Arrange 900g peeled and sliced potatoes on top of the meat, then drizzle with a little more dripping.","Cover, then place in the oven for about 1½ hrs until the potatoes are cooked.","Remove the lid, brush the potatoes with a little more dripping, then turn the oven up to brown the potatoes, or finish under the grill for 5-8 mins until brown."] 
    }
]